# 문제
# 상근이는 요즘 설탕공장에서 설탕을 배달하고 있다. 
# 상근이는 지금 사탕가게에 설탕을 정확하게 N킬로그램을 배달해야 한다. 
# 설탕공장에서 만드는 설탕은 봉지에 담겨져 있다. 
# 봉지는 3킬로그램 봉지와 5킬로그램 봉지가 있다.

# 상근이는 귀찮기 때문에, 최대한 적은 봉지를 들고 가려고 한다. 
# 예를 들어, 18킬로그램 설탕을 배달해야 할 때, 3킬로그램 봉지 6개를 가져가도 되지만, 
# 5킬로그램 3개와 3킬로그램 1개를 배달하면, 더 적은 개수의 봉지를 배달할 수 있다.

# 상근이가 설탕을 정확하게 N킬로그램 배달해야 할 때, 
# 봉지 몇 개를 가져가면 되는지 그 수를 구하는 프로그램을 작성하시오.

# 입력
# 첫째 줄에 N이 주어진다. (3 ≤ N ≤ 5000)

# 출력
# 상근이가 배달하는 봉지의 최소 개수를 출력한다. 
# 만약, 정확하게 N킬로그램을 만들 수 없다면 -1을 출력한다.

# 예제 입력 1     예제 출력 1 
# 18              4
# 예제 입력 2     예제 출력 2 
# 4               -1
# 예제 입력 3     예제 출력 3
# 6               2
# 예제 입력 4     예제 출력 4
# 9               3
# 예제 입력 5     예제 출력 5
# 11              3

# sugar = int(input())
# count = 0
# while sugar >=0:
#     if sugar%5 ==0:
#         count += sugar//5
#         print(count)
#         break
#     sugar -= 3
#     count += 1
# else:
#     print(-1)

# =============================================================================

# 문제
# 우현이는 어린 시절, 지구 외의 다른 행성에서도 인류들이 살아갈 수 있는 미래가 오리라 믿었다. 
# 그리고 그가 지구라는 세상에 발을 내려 놓은 지 23년이 지난 지금, 
# 세계 최연소 ASNA 우주 비행사가 되어 새로운 세계에 발을 내려 놓는 영광의 순간을 기다리고 있다.

# 그가 탑승하게 될 우주선은 Alpha Centauri라는 새로운 인류의 보금자리를 개척하기 위한 
# 대규모 생활 유지 시스템을 탑재하고 있기 때문에, 
# 그 크기와 질량이 엄청난 이유로 최신기술력을 총 동원하여 개발한 공간이동 장치를 탑재하였다. 
# 하지만 이 공간이동 장치는 이동 거리를 급격하게 늘릴 경우 기계에 심각한 결함이 발생하는 단점이 있어서, 
# 이전 작동시기에 k광년을 이동하였을 때는 k-1 , k 혹은 k+1 광년만을 다시 이동할 수 있다. 
# 예를 들어, 이 장치를 처음 작동시킬 경우 -1 , 0 , 1 광년을 이론상 이동할 수 있으나 
# 사실상 음수 혹은 0 거리만큼의 이동은 의미가 없으므로 1 광년을 이동할 수 있으며, 
# 그 다음에는 0 , 1 , 2 광년을 이동할 수 있는 것이다. 
# ( 여기서 다시 2광년을 이동한다면 다음 시기엔 1, 2, 3 광년을 이동할 수 있다. )


# 김우현은 공간이동 장치 작동시의 에너지 소모가 크다는 점을 잘 알고 있기 때문에 
# x지점에서 y지점을 향해 최소한의 작동 횟수로 이동하려 한다. 
# 하지만 y지점에 도착해서도 공간 이동장치의 안전성을 위하여 y지점에 도착하기 바로 직전의 이동거리는 반드시 1광년으로 하려 한다.

# 김우현을 위해 x지점부터 정확히 y지점으로 이동하는데 필요한 공간 이동 장치 작동 횟수의 최솟값을 구하는 프로그램을 작성하라.

# 입력
# 입력의 첫 줄에는 테스트케이스의 개수 T가 주어진다. 
# 각각의 테스트 케이스에 대해 현재 위치 x 와 목표 위치 y 가 정수로 주어지며, 
# x는 항상 y보다 작은 값을 갖는다. (0 ≤ x < y < 2^31)

# 출력
# 각 테스트 케이스에 대해 x지점으로부터 y지점까지 정확히 도달하는데 필요한 최소한의 공간이동 장치 작동 횟수를 출력한다.

# 예제 입력 1     예제 출력 1 
# 3           
# 0 3             3
# 1 5             3
# 45 50           4
import math

# T = int(input())
# for _ in range(T):
#     x, y = input().split()
#     distance = int(y)-int(x)
#     sqrt = math.sqrt(distance)
#     floor = math.floor(sqrt)
#     decimal = sqrt % 1
#     move = 0
#     if decimal == 0.0:
#         move = 2*floor-1
#     elif decimal < 0.5:
#         move = 2*floor
#     elif decimal >= 0.5:
#         move = 2*floor +1
    
#     if distance < 4:
#         move = distance
#     print(move)
        
    



# =============================================================================

# 문제
# 베르트랑 공준은 임의의 자연수 n에 대하여, 
# n보다 크고, 2n보다 작거나 같은 소수는 적어도 하나 존재한다는 내용을 담고 있다.

# 이 명제는 조제프 베르트랑이 1845년에 추측했고, 파프누티 체비쇼프가 1850년에 증명했다.

# 예를 들어, 10보다 크고, 20보다 작거나 같은 소수는 4개가 있다. (11, 13, 17, 19) 
# 또, 14보다 크고, 28보다 작거나 같은 소수는 3개가 있다. (17,19, 23)

# 자연수 n이 주어졌을 때, n보다 크고, 2n보다 작거나 같은 소수의 개수를 구하는 프로그램을 작성하시오. 

# 입력
# 입력은 여러 개의 테스트 케이스로 이루어져 있다. 각 케이스는 n을 포함하는 한 줄로 이루어져 있다.

# 입력의 마지막에는 0이 주어진다.

# 출력
# 각 테스트 케이스에 대해서, n보다 크고, 2n보다 작거나 같은 소수의 개수를 출력한다.

# 제한
# 1 ≤ n ≤ 123,456

# 예제 입력 1         예제 출력 1 
# 1                   1
# 10                  4
# 13                  3
# 100                 21
# 1000                135
# 10000               1033
# 100000              8392
# 0

max_num = 123456
num_list = [False, False]+[True] * (2*max_num)
m = int(2*max_num ** 0.5)
for i in range(2, m+1):
    if num_list[i]:
        for j in range(i+i, 2*max_num+1, i):
            num_list[j] = False

while 1:
    n = int(input())
    if n == 0:
        break
    print(len([i for i in range(n+1, 2*n+1) if num_list[i] == True]))





